
#ifndef _DLOAD_NARK_CORE_H
#define _DLOAD_NARK_CORE_H
/******************************************************************************
  1 其他头文件包含
******************************************************************************/
#include <linux/ioctl.h>
#include "dload_comm.h"

#ifdef  __cplusplus
    extern "C"{
#endif

/******************************************************************************
  2 模块对外 (宏、枚举、结构体、自定义数据类型) 定义区:
******************************************************************************/


#ifdef __cplusplus
}
#endif
#endif /* _DLOAD_NARK_CORE_H */
